[
  {
    "path": "posts/welcome/",
    "title": "Welcome to Assignment 1",
    "description": "Welcome to our new blog, Assignment 1. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-04-11",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-04-11T21:14:52+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-04-11-exploratory-analysis/",
    "title": "Exploratory Analysis",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Nora Jones",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-04-11",
    "categories": [],
    "contents": "\r\n1. Introduction\r\nMany factors can impact a person’s academic performance, family background and one’s lifestyle are two of the larger factors. The influence of family background may include financial status in the family’s ability to provide educational support, stability at home to provide emotional and mental support, among others. On the other hand, one’s lifestyle choices such as what he or she chooses to do during their free time, amount of time they spend on studying may have impact on one’s grades.\r\nSince there are many sub-factors in family background and lifestyle choices, the motivation of this study is hence to look deeper at these sub-factors to see which are the factors that have a greater correlation in the impact on a student’s grades. More specifically, this study aims to study the correlation between each factor and a student’s grades, as well as aiming to build a model that can accurately determine the academic performance of a student. From the findings, targeted help may be administered to students in these specific areas attributing to poor grades in school, therein helping them have a higher chance of a better future.\r\nHere, exploratory data analysis for the data set will be discussed and performed, which will be part of a module in a full Shiny-based Visual Analytics Application project.\r\n2. Literature Review\r\nBased on literature review on exploratory analysis performed for similar data sets involving education/grades, most provide a time-based analysis on grades where trends of variables are observed over time. Asides from that, a few provided simple bar charts to compare the target variable against others in different aspects. For example, a comparison of proportion between blacks and other minority groups in having various education certificates.\r\ninsert charts\r\nThe third chart is most similar to what will be attempted in this report, to explore proportions of the different variables and more. Due to the large number of variables in this study, it would make sense to include interactivity to allow the user to select variables for further analysis, rather than to generate more than twenty plots at one go. Also, they do not provide statistical comparisons between inputs for each variable. Another improvement would be the inclusion of number of data points and providing a visualization of boxplots, to better visualize the basic statistics of the variables.\r\n3. Data Extraction and Preparation\r\n3.1 Install/Load R Packages\r\nA list of packages are required for this protyping report. This code chunk installs the required packages for testing and loads them onto RStudio environment.\r\n\r\n\r\n\r\n3.2 Data Preparation and Cleaning\r\nThe data set used in this report is from Kaggle, which contains two csv files, student-mat.csv and student-por.csv. The data was obtained from a survey of Portuguese students aged 15 to 22 from mathematics and Portuguese language course. The data was obtained through a survey on family demographics, lifestyle factors, along with their grades in mathematics and Portuguese language. The data set contains other variables that can be broadly classified into family demographics and lifestyle factors.\r\nFirst, both csv files were imported by using the following code chunk utilizing read_csv(). Subsequently, a check was done to see if there were any null values. Given a FALSE output, we can proceed without having to deal with any null inputs.\r\n\r\n[1] FALSE\r\n\r\nSince some further manipulation will be done on the data along the way, data_cleaned was created to perform these manipulations while retaining the raw data available in data_all in case it is needed. Reviewing the data, we know that there are some variables that should be ordinal data, such as “Dalc” which is the workday alcohol consumption, with inputs ranging from 0 to 4 representing very low intake to very high intakes. Hence, another step to change these data to ordinal data along with the order was performed.\r\n\r\n\r\n# Duplicate data for further manipulation\r\ndata_cleaned <- data_all\r\n\r\n\r\n\r\n\r\n\r\n# Setting ordinal data levels\r\ndata_cleaned$Medu <- factor(data_cleaned$Medu, order = TRUE,\r\n                            levels = c(\"0\", \"1\", \"2\", \"3\", \"4\"))\r\n\r\ndata_cleaned$Fedu <- factor(data_cleaned$Fedu, order = TRUE,\r\n                            levels = c(\"0\", \"1\", \"2\", \"3\", \"4\"))\r\n\r\ndata_cleaned$failures <- factor(data_cleaned$failures, order = TRUE,\r\n                            levels = c(\"0\", \"1\", \"2\", \"3\"))\r\n\r\ndata_cleaned$famrel <- factor(data_cleaned$Medu, order = TRUE,\r\n                            levels = c(\"1\", \"2\", \"3\", \"4\", \"5\"))\r\n\r\ndata_cleaned$freetime <- factor(data_cleaned$freetime, order = TRUE,\r\n                            levels = c(\"1\", \"2\", \"3\", \"4\", \"5\"))\r\n\r\ndata_cleaned$goout <- factor(data_cleaned$goout, order = TRUE,\r\n                            levels = c(\"1\", \"2\", \"3\", \"4\", \"5\"))\r\n\r\ndata_cleaned$Dalc <- factor(data_cleaned$Dalc, order = TRUE,\r\n                            levels = c(\"1\", \"2\", \"3\", \"4\", \"5\"))\r\n\r\ndata_cleaned$Walc <- factor(data_cleaned$Walc, order = TRUE,\r\n                            levels = c(\"1\", \"2\", \"3\", \"4\", \"5\"))\r\n\r\ndata_cleaned$health <- factor(data_cleaned$health, order = TRUE,\r\n                            levels = c(\"1\", \"2\", \"3\", \"4\", \"5\"))\r\n\r\n\r\n\r\n3.3 Initial Data Analysis\r\nAs the grades in this data set involves students from two different schools and two different subjects, we will need to find out if the results for each of them are statistically different from the other. Also, since 3 grades are given, G1, G2 and G3, representing results from the first period, second period, and the final grade, we also want to find out if there is any statistically significant difference between the results. For the analysis, ANOVA technique will be used and a new data set with the required variables - school, G1, G2, G3 and subject will be used.\r\nFurther data manipulation was done to firstly create a new data set with the required variables, then creating a new data perform pivoting for the grades.\r\n\r\n\r\n# Creating pivot data for G1, G2 and G3\r\nanova_data <- data_cleaned[, c(\"school\", \"G1\", \"G2\", \"G3\", \"subject\")]\r\nanova_data_pivot <- pivot_longer(anova_data, -c(school, subject), values_to = \"Score\", names_to = \"G\")\r\n\r\n\r\n\r\nDifference in Grades\r\nThe data set provides results through 3 variables (G1, G2, G3) while the goal would be to have a single target grade variable for further analysis, which will make sense if the three variables are not statistically different. For the comparison between grades, one way ANOVA will be used. As all the p-values generated are more than 0.05 for a 95% confidence level, we can say that the variables are not statistically different from each other. Hence, in order to have a single target grade, the average of the three variables will be used and named “avgscore”.\r\n\r\n\r\n# Performing one-way ANOVA analysis\r\nanova_grades <- aov(Score~G, data = anova_data_pivot)\r\nanova(anova_grades)\r\n\r\n\r\nAnalysis of Variance Table\r\n\r\nResponse: Score\r\n            Df Sum Sq Mean Sq F value Pr(>F)\r\nG            2      9  4.6475  0.4026 0.6686\r\nResiduals 3129  36118 11.5430               \r\n\r\n\r\n\r\n# Creating new column for average score, then removing G1, G2 and G3\r\ndata_cleaned$avgscore <- ((data_cleaned$G1 + data_cleaned$G2 + data_cleaned$G3)/3)\r\ndata_cleaned = subset(data_cleaned, select = -c(G1, G2, G3))\r\n\r\n\r\n\r\nDifference in School and Subject\r\nSince there are two variables that we would like to analyze, a two-way ANOVA test was performed and showed that results for both schools and both subjects are significantly different.\r\n\r\n\r\n# Performing two-way ANOVA analysis\r\nanova_twoway <- aov(Score~subject * school, data = anova_data_pivot)\r\nanova(anova_twoway)\r\n\r\n\r\nAnalysis of Variance Table\r\n\r\nResponse: Score\r\n                 Df Sum Sq Mean Sq F value    Pr(>F)    \r\nsubject           1    659  658.88  60.475 1.004e-14 ***\r\nschool            1   1238 1238.19 113.647 < 2.2e-16 ***\r\nsubject:school    1    151  150.54  13.817  0.000205 ***\r\nResiduals      3128  34080   10.90                      \r\n---\r\nSignif. codes:  0 '***' 0.001 '**' 0.01 '*' 0.05 '.' 0.1 ' ' 1\r\n\r\nSince the grades are significantly different between schools and between grades, they will be analyzed separately in this report with the following four combinations:\r\nGabriel Pereira + Math\r\nGabriel Pereira + Portugese\r\nMousinho da Silveira + Math\r\nMousinho da Silveira + Portugese\r\n\r\n\r\n# Split by school\r\ndata_GP <- subset(data_cleaned, school == \"GP\")\r\ndata_MS <- subset(data_cleaned, school == \"MS\")\r\n\r\n# Then split by subject\r\ndata_GP_math <- subset(data_GP, subject == \"math\")\r\ndata_GP_por <- subset(data_GP, subject == \"por\")\r\ndata_MS_math <- subset(data_MS, subject == \"math\")\r\ndata_MS_por <- subset(data_MS, subject == \"por\")\r\n\r\n# Remove school and subject variable\r\ndata_GP_math = subset(data_GP_math, select = -c(subject, school))\r\ndata_GP_por = subset(data_GP_por, select = -c(subject, school))\r\ndata_MS_math = subset(data_MS_math, select = -c(subject, school))\r\ndata_MS_por = subset(data_MS_por, select = -c(subject, school))\r\n\r\n\r\n\r\n4. Exploratory and Confirmatory Data Analysis\r\nFor EDA and CDA, there will be three sections to be worked on. First, will be a section to view the distribution of each variable, allowing the user to have a quick overview of each variable in terms of the proportions and distribution. Next, a section to compare the average results by different inputs in a variable. This will allow the user to compare the differences in average grades for each input, for example comparing the grades between students who have a family size of more than or less than 3. Lastly, a section to plot out the correlation between all the variables, including the average grade. This will allow the user to see the correlation strength between each variable, and each variable with the average grade. Further details for each section will be documented below.\r\n4.1 Section 1: Distributions and Proportions\r\nFor the initial exploratory analysis, we want to look at the distributions and proportions of the given data. While most of the variables can be visualized using a basic bar chart, some of the variables such as average score would be better visualized using a histogram due to the variable having a larger range of inputs.\r\nHere, ggplot2 package was used as the main package as it allows for basic editing of the chart such as the titles or colour schemes of the chart and below shows an example of each of the three charts.\r\nChart 1 (Bar Chart):\r\nThe code chunk here using ggplot will plot a bar chart to visualize the distribution and proportions of variables. The proportion percentage of each input will be calculated and reflected on the chart itself for the user to readily have exact data on the proportions. This was made more obvious by adding transparency to the bar chart.\r\nThe chart will include an option for the user to have two inputs. First, to select which of the data sets he or she would like to view - the four data sets split by school and subject, or the combined data. Second, the variable to study. For ordinal data, with the same code ggplot automatically colours them by gradient, with the lower levels being darker.\r\nExample of proportion of students in the two schools for the combined data set:\r\n\r\n\r\nggplot(data_cleaned) +\r\n  aes(x = school, fill = school) +\r\n  geom_bar(aes(x = school, fill = school), color = \"black\", alpha = 0.5) +\r\n  geom_text(aes(label = scales::percent(..prop..), group = 1, y= ..prop.. ), stat= \"count\", vjust = -1.5) +\r\n  ggtitle(\"Distribution and Proportion of Variables\") +\r\n  theme(axis.title.x = element_blank())\r\n\r\n\r\n\r\n\r\nExample of proportion of students with indicated mother’s job for the students in the Gabriel Pereira school taking math:\r\n\r\n\r\nggplot(data_GP_math) +\r\n  aes(x = Mjob, fill = Mjob) +\r\n  geom_bar(aes(x = Mjob, fill = Mjob), color = \"black\", alpha = 0.5) +\r\n  geom_text(aes(label = scales::percent(..prop..), group = 1, y= ..prop.. ), stat= \"count\", vjust = -1.5) +\r\n  ggtitle(\"Distribution and Proportion of Variables\") +\r\n  theme(axis.title.x = element_blank())\r\n\r\n\r\n\r\n\r\nExample of ordinal data, mother’s education level of students in the whole data set:\r\n\r\n\r\nggplot(data_cleaned) +\r\n  aes(x = Medu, fill = Medu) +\r\n  geom_bar(aes(x = Medu, fill = Medu), color = \"black\", alpha = 0.5) +\r\n  geom_text(aes(label = scales::percent(..prop..), group = 1, y= ..prop.. ), stat= \"count\", vjust = -1.5) +\r\n  ggtitle(\"Distribution and Proportion of Variables\") +\r\n  theme(axis.title.x = element_blank())\r\n\r\n\r\n\r\n\r\nChart 2 (Histogram):\r\nThe histogram chart includes a fill colour to avoid using black, and has a starting fixed bin width of 1. However, this input of the bin number will be an available input for the user to change. Furthermore, the plot will be presented using ggplotly package to allow the user to see the detail by hovering over each bar since the range of data could be very wide, for instance the number of absences which ranges from 0 to 75. Here, the user is able to input the data set as well as the variable he or she wishes to view as well.\r\nExample of number of absences for students in Gabriel Pereira school taking math:\r\n\r\n\r\nhisto <- ggplot(data_GP_math) +\r\n  aes(x = absences) +\r\n  geom_histogram(binwidth=1, color=\"black\", fill=\"light blue\") +\r\n  ggtitle(\"Distribution and Proportion of Variables\") +\r\n  theme(axis.title.x = element_blank())\r\n\r\nggplotly(histo)\r\n\r\n\r\npreservea76df3f0208988d9\r\n\r\nExample of distribution of average scores for students in the whole data set:\r\n\r\n\r\nhisto <- ggplot(data_cleaned) +\r\n  aes(x = avgscore) +\r\n  geom_histogram(binwidth=1, color=\"black\", fill=\"light blue\") +\r\n  ggtitle(\"Distribution and Proportion of Variables\") +\r\n  theme(axis.title.x = element_blank())\r\n\r\nggplotly(histo)\r\n\r\n\r\npreserveb8f3949f399f67f3\r\n\r\n4.2 Section 2: Comparison of Results\r\nThis section looks at the difference in average grades between individual inputs in each variable.\r\nThe ggplot2 package was first considered, and instead of just using a boxplot with jitters, a violin plot was used. This is because of the many data points which will cause the chart to look messy with the jittering, while the violin plot is able to show the distribution of data in a clean way. A statistical comparison between means was also implemented where the p-value would be indicated in the chart.\r\nHowever, testing out the plot generated by ggbetweenstats was found to be a better option due to several reasons. Aesthetically it provides a chart with better design, as well as automatically providing more information such as number of variable input size and the mean for each input. It also is able to produce a violin and boxplot to visualize the interquartile range and distribution of data points.\r\nAs the grades for the subjects and schools have been shown to be significantly different, similar to Section 1, on top of a user input for the variable to study, a user input will be given for the selection of viewing data for different combinations of subjects and schools. The user will also be able to select the type of statistical test to be performed to compare the results within each variable.\r\nExample of chart using ggplot:\r\n\r\n\r\n# Attempt using ggplot\r\np <- ggplot(data_MS_math, aes(x = sex, y = avgscore, color=sex)) +\r\n  geom_violin(position=position_dodge(1)) +\r\n  geom_boxplot(color = \"black\", alpha=0.5)\r\n\r\np + stat_compare_means(label = \"p.format\", method = \"t.test\")\r\n\r\n\r\n\r\n\r\nExample of chart using ggbetweenstats:\r\n\r\n\r\n# Attempt using ggbetweenstats\r\nggbetweenstats(\r\n  data = data_cleaned,\r\n  x = sex,\r\n  y = avgscore,\r\n  pairwise.display = all,\r\n  results.subtitle = TRUE,\r\n  bf.message = FALSE,\r\n  type = \"p\",\r\n  title = \"Comparison of Variables Against Average Score\")\r\n\r\n\r\n\r\n\r\n4.3 Section 3: Correlation\r\nIn this section, correlation charts will be generated to compare the correlation between variables as well as to the target - average grade. Before plotting, dummy variables were created for the categorical variables. Subsequently, G1, G2 and G3 were removed since we are only interested in the average grade here. Since Medu and Fedu are categorical data in numerical form, the model.matrix did not capture this variable to create dummy variables. Hence, they were separately created.\r\n\r\n\r\n# Creating dummy variables for categorical and non-numerical data\r\ndata_for_corr_all <- data_all\r\ndata_for_corr <- model.matrix(~0+., data=data_for_corr_all)\r\ndata_for_corr <- as.data.frame(data_for_corr)\r\ndata_for_corr = subset(data_for_corr, select = -c(G1, G2, G3))\r\n\r\ndata_for_corr <- fastDummies::dummy_cols(data_for_corr, select_columns = \"Medu\")\r\ndata_for_corr <- fastDummies::dummy_cols(data_for_corr, select_columns = \"Fedu\")\r\ndata_for_corr = subset(data_for_corr, select = -c(Medu, Fedu))\r\n\r\ndata_for_corr$avgscore <- ((data_all$G1 + data_all$G2 + data_all$G3)/3)\r\n\r\n\r\n\r\n\r\n\r\n# Resplitting by school and subject\r\ndata_cor_GP <- subset(data_for_corr, schoolGP == \"1\")\r\ndata_cor_MS <- subset(data_for_corr, schoolMS == \"1\")\r\n\r\ndata_cor_GP_math <- subset(data_cor_GP, subjectpor == \"0\")\r\ndata_cor_GP_por <- subset(data_cor_GP, subjectpor == \"1\")\r\ndata_cor_MS_math <- subset(data_cor_MS, subjectpor == \"0\")\r\ndata_cor_MS_por <- subset(data_cor_MS, subjectpor == \"1\")\r\n\r\ndata_cor_GP_math = subset(data_cor_GP_math, select = -c(subjectpor, schoolGP, schoolMS))\r\ndata_cor_GP_por = subset(data_cor_GP_por, select = -c(subjectpor, schoolGP, schoolMS))\r\ndata_cor_MS_math = subset(data_cor_MS_math, select = -c(subjectpor, schoolGP, schoolMS))\r\ndata_cor_MS_por = subset(data_cor_MS_por, select = -c(subjectpor, schoolGP, schoolMS))\r\n\r\n\r\n\r\nIn this section, the user will first be allowed to choose to view a static plot or interactive plot. The static plot uses an ellipse method, where based on the shade of colour and the direction of the ellipse, the correlation is clear between variables. This gives a general overview of the data and the respective correlations strengths.\r\nOn the other hand, an interactive plot can be used should the user want to review the correlation in detail. Here, the user will be able to see the correlations value along with the two associated variables by hovering the cursor over the specific square. With the colours based on correlation, the user is also able to have a rough overview of the correlations as well.\r\nStatic Plot\r\n\r\n\r\ndata.cor = cor(data_cor_GP_math)\r\nstatic_corr <- corrplot(data.cor,\r\n         method = \"ellipse\", \r\n         type=\"lower\",\r\n         diag = FALSE,\r\n         tl.col = \"black\",\r\n         tl.cex=0.7)\r\n\r\n\r\n\r\n\r\n\r\n\r\np.mat <- cor_pmat(data_cor_GP_por)\r\n\r\ncorr.plot <- ggcorrplot(\r\n  data.cor, \r\n  type = \"upper\", \r\n  outline.col = \"black\",\r\n  tl.cex=7,\r\n  colors = c(\"red\", \"white\", \"blue\")\r\n  )\r\ninteractive_cor <- ggplotly(corr.plot)\r\n\r\ninteractive_cor\r\n\r\n\r\npreserveb85e7ee69553ffad\r\n\r\n5. Conclusion\r\nWith interactivity implemented in the visualization, users can intentionally select the combinations of inputs that he or she wants to review further, and it helps clarity especially in data sets that have many variables. This will impact not just the total number of charts showing at one go, but the information that appears to the user. For example, the correlation plots. Should every box contain numerical data on correlation, it might be overwhelming for the user, compared to allowing the user to mouse over the data points to review. Adding statistical inputs for the charts also allows the user to make quick conclusions not based on a wild guess but based on mathematical calculations which allows the user to quickly analyze the data.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-04-11-exploratory-analysis/exploratory-analysis_files/figure-html5/unnamed-chunk-10-1.png",
    "last_modified": "2021-04-11T21:33:10+08:00",
    "input_file": "exploratory-analysis.utf8.md"
  }
]
